BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
      //Save measurements into temporary memory.
      if ( ! rtcmem.saveMeasurements(&m, sizeof(m))) //If data is not saved correctly in RAM...
      {
        Serial.printf(" \n -------- RTC memory full. Saving data to flash and clearing memory... --------");
        /* save to flash, clear RAM and then rewrite to it */
        uint8 buf[288];   //Temporary buffer to read measurements.

        uint16_t packets = rtcmem.readMeasurements(buf);
        archiveWrite(buf, sizeof(Measurement)*packets);   //Write data into archive (flash memory).
    
        rtcmem.clearMeasurements();               //Clears rtc memory.
        rtcmem.saveMeasurements(&m, sizeof(m));   //Saves current measurement.

        // statem.setState(STATE_TRANSMISSION);   //Transmit pending data.
      }
  
      statem.setState(STATE_DEEP_SLEEP);    //Goes deep sleep...
    }
  }
  else if (statem.getState() == STATE_SAVE_MEASUREMENTS){
    if(statem.stateInit()){
      Serial.print("\n --- State: STATE_SAVE_MEASUREMENTS ---");

    }
    

  }
  else if (statem.getState() == STATE_TRANSMISSION){
    if(statem.stateInit()){
      Serial.print("\n --- State: STATE_TRANSMISSION ---");

      uint8_t buf[576];
      uint16_t pending_packets, sent_packets;
      pending_packets = rtcmem.rwVariables().archive_saved_pointer - rtcmem.rwVariables().archive_sent_pointer - 1;
      Serial.printf("\n\n archive_sent_pointer= %d", rtcmem.rwVariables().archive_sent_pointer);
      Serial.printf("\n archive_saved_pointer= %d", rtcmem.rwVariables().archive_saved_pointer);
      Serial.printf("\n packets pending: %d", pending_packets);
 
      
      //Send pending measurements and increments the pointer by the amount of sent packets.
      rtcmem.var.archive_saved_pointer = archiveGetPointer(); //Make sure that pointer is updated (if value lost due power failure).
      sent_packets = sendMeasurements(rtcmem.rwVariables().archive_sent_pointer, 0);
      rtcmem.var.archive_sent_pointer += sent_packets;
      rtcmem.rwVariables();

      Serial.printf("\n\n %d packets succesfully sent.", sent_packets);

      rtcmem.safeDisconnect();  //Save current values.
      statem.setState(STATE_DEEP_SLEEP);
    }
  }
  else if (statem.getState() == STATE_FORCE_MEASUREMENT){
    if(statem.stateInit()){
      Serial.print("\n --- State: FORCE STATE_FORCE_MEASUREMENT ---");
      Serial.print("\n Obtaining measurements... ");
      
      uint8 buf[RTC_MEMORY_MEASUREMENTS_COUNT*sizeof(Measurement)];   //Temporary buffer to read measurements.
      uint16_t packets;
      Measurement m = getMeasurements();
      
      packets = rtcmem.readMeasurements(buf); //Read all the measurements stored into RTC memory.
      
      archiveWrite(buf, sizeof(Measurement)*packets);   //Write data into archive (flash memory).
      archiveWrite(&m, sizeof(Measurement));    //Write last measurement
      rtcmem.clearMeasurements();   //Clears rtc memory.
      
      //Current measurement is not saved to RTC memory, as it is directly saved into archive
      //to be sent to the server.
      
      statem.setState(STATE_TRANSMISSION);   //Transmit pending data.
    }
  }
  else if (statem.getState() == STATE_CONFIGURATION){
   
    if(statem.stateInit()){
      Serial.print("\n --- State: STATE_CONFIGURATION ---");

      runWebServer();   //Run web server.
      // rtcmem.safeDisconnect();   //Better use this when entering configuration mode (save variables)
    }

    server.handleClient(); //Handling of incoming requests
  }
  else if (statem.getState() == STATE_SEALED){
    if(statem.stateInit()){
      Serial.print("\n --- State: STATE_SEALED ---");
      rtcmem.safeDisconnect();    //Saves variables...
      //Log power failure.
      delay(100);     //100ms delay.
      setBatteryState(OFF); //Disconnect battery, device will turn off.
    }

  }
  else if (statem.getState() == STATE_DEEP_SLEEP){
    if(statem.stateInit()){
      Serial.print("\n --- State: STATE_DEEP_SLEEP ---");

      pinMode(DHT_SENSOR_1_PIN, INPUT_PULLUP);
      pinMode(DHT_SENSOR_2_PIN, INPUT_PULLUP);
      pinMode(DHT_SENSOR_3_PIN, INPUT_PULLUP);
      pinMode(DHT_SENSOR_4_PIN, INPUT_PULLUP);

      wifiTurnOff();
      Serial.printf("\nDevice has been running for %d ms.", millis());
      goDeepSleep(config_globals.sample_time*1000 - millis());
    }
  }

}

void portInit(void){
  pinMode(PWR_SENSORS_PIN_P, OUTPUT);   //GPIO13 as output
  pinMode(PWR_SENSORS_PIN_N, OUTPUT);   //GPIO13 as output
  pinMode(PWR_CONTROL_PIN, OUTPUT);
  pinMode(REED_SWITCH_PIN, INPUT);
  pinMode(PWR_CONTROL_PIN, OUTPUT);

  dischargeCapacitor();

  pinMode(DHT_SENSOR_1_PIN, INPUT);
  pinMode(DHT_SENSOR_2_PIN, INPUT);
  pinMode(DHT_SENSOR_3_PIN, INPUT);
  pinMode(DHT_SENSOR_4_PIN, INPUT);

  digitalWrite(PWR_CONTROL_PIN,HIGH);

  setSensorPower(OFF);          //Sensors start turned off.
}

void setBatteryState(uint8 state){
  if (state == ON)
  {
    digitalWrite(PWR_CONTROL_PIN, HIGH);
    pinMode(PWR_CONTROL_PIN, OUTPUT);
  }
  else if (state == OFF)
  {
    pinMode(PWR_CONTROL_PIN, OUTPUT);
    digitalWrite(PWR_CONTROL_PIN, LOW);
  }  
}

uint8_t getBatteryLevel(void){
  //It is necessary to turn on the sensors in order to measure the battery level:
  setSensorPower(ON);
  delay(10);  //10ms delay...
  uint16 adcr = analogRead(BATTERY_SENSE_PIN);
  setSensorPower(OFF);

  uint16_t voltage = (uint16_t)((adcr * ADC_VOLTAGE_MV)/(1023)); //Read value
  // Serial.printf("\nVoltage = %dmV" ,voltage);
  uint16_t real_voltage = (uint16_t)((float)(voltage*VBAT_VADC_RATIO) + Q_VCE_COMPENSATION);   //Actual voltage before divider.
  // Serial.printf("\nReal voltage = %dmV" ,real_voltage);
  uint8_t percentage = ( ((real_voltage - BATTERY_MIN_VOLTAGE)*100) / (BATTERY_MAX_VOLTAGE-BATTERY_MIN_VOLTAGE) );
  // Serial.printf("\nPercentage: %d" ,percentage);

  if(percentage > 100)  percentage=100; //Limit maximum value.

  return percentage;  //Returns battery percentage.
}

bool checkBattery(void){
  if (getBatteryLevel() >= BATTERY_MIN_PERCENTAGE) 
    return true;    
  else            //when out of battery
    return false;     
}

bool isCharging(void){
  //Returns true if the device is being charged.
/*   setSensorPower(OFF);    //Sensors must be powered off in order to detect the charger properly.
  pinMode(PWR_SENSORS_PIN_P, INPUT);  //As the same pin is used to power sensors and sense USB connected, put it as input temporarily.
  if ( !digitalRead(CHARGER_DETECT_PIN) ){  
    Serial.print("\nCharging.");
    pinMode(PWR_SENSORS_PIN_P, OUTPUT);    //Returns to original state.
    return true;}
  else{ 
    Serial.print("\nNot charging.");
    pinMode(PWR_SENSORS_PIN_P, OUTPUT);    //Returns to original state.
    return false; 
  }  */

  pinMode(CHARGER_DETECT_PIN, INPUT); //GPIO3 (RX) pin put as input to sense.

