BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
Measurement getMeasurements(void){
  //Turns sensors on, take measurements, format them and return.
  Measurement m;
  dht22_sensor_1.begin();           //Initializes objects.
  dht22_sensor_2.begin();
  dht22_sensor_3.begin();
  dht22_sensor_4.begin();

  setSensorPower(ON);
  delay(SENSOR_ON_TIME);  
  //GET MEASUREMENTS
  m.timestamp=rtcmem.getCurrentTime();  //Put current timestamp
  m.id_sensor[0] = 1;   //Read sensor number from configuration file.
  m.id_sensor[1] = 2; 
  m.id_sensor[2] = 3; 
  m.id_sensor[3] = 4;
  m.temperature[0] = generateMeasurementValue(TEMPERATURE, dht22_sensor_1.readTemperature());
  m.temperature[1] = generateMeasurementValue(TEMPERATURE, dht22_sensor_2.readTemperature());
  m.temperature[2] = generateMeasurementValue(TEMPERATURE, dht22_sensor_3.readTemperature());
  m.temperature[3] = generateMeasurementValue(TEMPERATURE, dht22_sensor_4.readTemperature());
  m.humidity[0] = generateMeasurementValue(HUMIDITY, dht22_sensor_1.readHumidity());
  m.humidity[1] = generateMeasurementValue(HUMIDITY, dht22_sensor_2.readHumidity());
  m.humidity[2] = generateMeasurementValue(HUMIDITY, dht22_sensor_3.readHumidity());
  m.humidity[3] = generateMeasurementValue(HUMIDITY, dht22_sensor_4.readHumidity()); 

  setSensorPower(OFF);

  return(m);
}

String generatePOSTRequest(void* data, uint16_t packets){
  /*This function receives data saved to flash (array) and generates the POST request to send
    it to the server, which is returned.
    Necessary data:
  */
  
  String request="";  //Initialize empty string.
  String values_timestamp=  "[";
  String values_id_sensor=  "[";
  String values_temperature="[";
  String values_humidity=   "[";

  Measurement m;  //Temporary variable.
  for (uint16_t p = 0; p < packets; p++){ //For each packet...
    memcpy(&m, data+(p * sizeof(m)), sizeof(m));    //Copies one packet into the temporary memory.

    for (uint8_t s = 0; s < DATALOGGER_SENSOR_COUNT; s++){ //For each sensor...
      values_timestamp+= (String)m.timestamp;
      values_id_sensor  +=(String)m.id_sensor[s];
      values_temperature+=(String)m.temperature[s];
      values_humidity   +=(String)m.humidity[s];

      if( p < packets-1){   //If it is not the last packet...
          values_timestamp+=  ",";          
          values_id_sensor+=  ",";
          values_temperature+=",";
          values_humidity+=   ",";
      }
      else{   //If it is the last element, closes the bracket.
        if(s < DATALOGGER_SENSOR_COUNT - 1){
          values_timestamp+=  ",";          
          values_id_sensor+=  ",";
          values_temperature+=",";
          values_humidity+=   ",";
        }  
        else{
          values_timestamp+=  "]";      
          values_id_sensor+=  "]";      
          values_temperature+="]";      
          values_humidity+=   "]"; 
        } 
      }
    }
  }
  
  request += "id_transceiver=1";      //? symbol deleted as it is not needed into POST method.
  request += "&battery_level="+(String)getBatteryLevel();
  request += "&timestamp="+   values_timestamp;
  request += "&id_sensor="+   values_id_sensor;
  request += "&temperature="+ values_temperature;
  request += "&humidity="+    values_humidity; 
  
  // Serial.print("\n Generated POST request: ");
  // Serial.println(request);  
  
  return request;
}

uint16_t sendMeasurements(uint16_t start_packet, uint16_t packets){
  /*
      This function takes data packets and sends them to the server.
      "packets" default value is 0, so if not specified in function call, it will send all the
      pending packets instead of the amount specified. 
  */
  pinMode(LED_R_PIN, OUTPUT);
  pinMode(LED_G_PIN, OUTPUT);
  pinMode(LED_B_PIN, OUTPUT);
  digitalWrite(LED_R_PIN, HIGH);    //Turn off leds.
  digitalWrite(LED_G_PIN, HIGH);
  digitalWrite(LED_B_PIN, HIGH);


  HTTPClient http;
  uint16_t start_connection_time;
  uint8_t request_retries=0;
  uint16_t sent_packets_amount = 0;
  // bool connection_timeout=false, request_timeout=false;

  wifiTurnOn(); //Turn on wifi.
  // Serial.setDebugOutput(true);  //DEBUG
  WiFi.begin(config_globals.server_ap_ssid, config_globals.server_ap_pass);
  
  Serial.print("\nConnecting to network...");
  start_connection_time = millis();
  while(WiFi.status() != WL_CONNECTED && (millis() - start_connection_time < config_globals.connection_timeout)){ //Blocks until Wifi is connected. 
    digitalWrite(LED_B_PIN, LOW); //Blink GREEN led.
    delay(50);
    digitalWrite(LED_B_PIN, HIGH);
    
    yield(); 
  }
  digitalWrite(LED_B_PIN, HIGH);

  if(WiFi.status() == WL_CONNECTED){
    
    uint8_t buf[MAX_PACKET_PER_REQUEST*sizeof(Measurement)]; //288 bytes.
    //Generate full URL.
    String url = "http://"+(String)config_globals.server_ip+":"+(String)config_globals.server_port;
    url+=SEND_MEASUREMENTS_URL;
    Serial.print("\n url: ");   Serial.println(url);

    Serial.printf("\n HTTP client started: %d",  http.begin(url));   //Specify request destination

    uint16_t end_packet, i, n, pending_packets;

    if(packets == 0){ //Initialization of start and final packets index.
      start_packet = rtcmem.rwVariables().archive_sent_pointer; //The last sent packet following one.
      end_packet = rtcmem.rwVariables().archive_saved_pointer-1;    //The last saved packet into archive (maximum).
    }
    else{ 
      end_packet = start_packet + packets;
      if(end_packet > rtcmem.rwVariables().archive_saved_pointer-1)
        end_packet = rtcmem.rwVariables().archive_saved_pointer-1;
    }
    i = start_packet;
    n = MAX_PACKET_PER_REQUEST;
    if(i+n > end_packet){    //Limit the amount of packets to read if there are less than the maximum.
      n = end_packet-i; //Equals to pending packets.
    }
    
    while(n > 0 && request_retries < config_globals.connection_retry){   //While there are pending packets...
      
      archiveRead(buf, i,n); //Read "n" packets starting from packet number "i"

      String request = generatePOSTRequest(buf, n); //Generate request with n elements.
      Serial.print("\n[HTTP] POST...:\n");  Serial.print(request);

      http.addHeader("Content-Type", "text/plain");  //Specify content-type header
      int httpCode = http.POST(request);   //Send the request
      if(httpCode > 0){
        String payload = http.getString();  
        Serial.print("\n Response:"); Serial.println(payload);  
        http.end(); //for test.
 
        LED_Color(COLOR_GREEN);     //Blink GREEN led.
        delay(50);
        LED_Color(COLOR_BLACK);

        sent_packets_amount += n;   //Increase sent packets counter.

        i += n;  //"i" is now the last read packet.
        n = MAX_PACKET_PER_REQUEST;
        if(i+n > end_packet)    //Limit the amount of packets to read if there are less than the maximum.
          n = end_packet-i; //equal n to que amount of pending packets.
        
        Serial.printf("\n      DATA SENT. Packets pending: %d", end_packet-i);
        Serial.printf("\n  Packets in next request: %d", n);
        Serial.printf("\n  i=%d  /  n=%d\n", i, n);
      }
      else{
        Serial.printf("\n Error. Response code:%d", httpCode);
        LED_Color(COLOR_RED);     //Blink red led.
        delay(100);
        LED_Color(COLOR_BLACK);

        request_retries++;
        if(request_retries < config_globals.connection_retry);  //This semicolon should not be here as it inhibits the if...
          Serial.printf("\n HTTP client started: %d",  http.begin(url));   //Specify request destination
      }
      yield();
    }
    
    //Get current time.
    url = "http://"+(String)config_globals.server_ip+":"+(String)config_globals.server_port;
    url+=GET_TIME_URL;
    Serial.print("\n url: ");   Serial.println(url);
    http.begin(url);
    if(http.GET() > 0){   //If return code is valid
      String payload = http.getString();
      payload = payload.substring(payload.indexOf("\n")+1); //Get only the numeric value.
      rtcmem.var.current_time = payload.toInt();
      rtcmem.var.last_sync_time = rtcmem.var.current_time;
      rtcmem.rwVariables();
      
      Serial.printf("\n UTC time from server: %d\n", rtcmem.rwVariables().last_sync_time);
    }
    else
      Serial.print("\nUnable to obtain time.");
    
    http.end();
    wifiTurnOff();
    return sent_packets_amount;
  }
  else{
    Serial.print("\nConnection timeout.");
    wifiTurnOff();
    LED_Color(COLOR_RED);     //Blink red led.
    yield();
    delay(200);
    LED_Color(COLOR_BLACK);;
    LED_Color(COLOR_RED);; //Blink red led.
    yield();
    delay(200);
    LED_Color(COLOR_BLACK);;

